In [75]:
import numpy as np
import pandas as pd

In [76]:
data = np.random.randn(4,3)

In [77]:
data

array([[ 1.11285341,  1.4153674 ,  1.34517053],
       [ 0.33838653,  0.45382459, -0.48966189],
       [ 0.17348736, -0.40863567,  0.30490047],
       [-0.3345633 ,  0.09490013,  0.07662361]])

In [78]:
#Data Frame serilerin iki boyutlu halidir
dataFrame = pd.DataFrame(data)

In [79]:
dataFrame

          0         1         2
0  1.112853  1.415367  1.345171
1  0.338387  0.453825 -0.489662
2  0.173487 -0.408636  0.304900
3 -0.334563  0.094900  0.076624

In [80]:
yeniDataFrame = pd.DataFrame(data,index = ["Atil","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])

In [81]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Zeynep  0.338387  0.453825      -0.489662
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [82]:
#Kolon çağırmak için
yeniDataFrame["Yas"]

Atil      1.415367
Zeynep    0.453825
Atlas    -0.408636
Mehmet    0.094900
Name: Yas, dtype: float64

In [83]:
yeniDataFrame["Calisma Saati"]

Atil      1.345171
Zeynep   -0.489662
Atlas     0.304900
Mehmet    0.076624
Name: Calisma Saati, dtype: float64

In [84]:
#İki kolon yanyana geldiğinde çift köşeli parantez kullann
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    1.112853  1.415367
Zeynep  0.338387  0.453825
Atlas   0.173487 -0.408636
Mehmet -0.334563  0.094900

In [85]:
#Satır çağırmak için
yeniDataFrame.loc["Atil"]

Maas             1.112853
Yas              1.415367
Calisma Saati    1.345171
Name: Atil, dtype: float64

In [86]:
#İndeks olarakta satır çağırabiliriz
yeniDataFrame.iloc[1]

Maas             0.338387
Yas              0.453825
Calisma Saati   -0.489662
Name: Zeynep, dtype: float64

In [87]:
#Kolon eklerken hazır kolonları kullanabiliriz
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [88]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.112853  1.415367       1.345171        2.830735
Zeynep  0.338387  0.453825      -0.489662        0.907649
Atlas   0.173487 -0.408636       0.304900       -0.817271
Mehmet -0.334563  0.094900       0.076624        0.189800

In [89]:
#Eğer kolon silmek istiyorsak kullanılır ama sadece o hücrede geçerli olur kalıcı değişiklik yapmaz ve eksen belirtmek hata alamamak için gerekli(axis)
yeniDataFrame.drop("Emeklilik Yasi",axis = 1)

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Zeynep  0.338387  0.453825      -0.489662
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [90]:
yeniDataFrame.drop("Mehmet",axis = 0)

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.112853  1.415367       1.345171        2.830735
Zeynep  0.338387  0.453825      -0.489662        0.907649
Atlas   0.173487 -0.408636       0.304900       -0.817271

In [91]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    1.112853  1.415367       1.345171        2.830735
Zeynep  0.338387  0.453825      -0.489662        0.907649
Atlas   0.173487 -0.408636       0.304900       -0.817271
Mehmet -0.334563  0.094900       0.076624        0.189800

In [92]:
#Değişiklik kalıcı olsun istiyorsak inplace değeri true verilmeli
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)

In [93]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Zeynep  0.338387  0.453825      -0.489662
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [94]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

np.float64(1.3451705322605232)

In [95]:
yeniDataFrame.loc["Atil","Calisma Saati"]

np.float64(1.3451705322605232)

In [96]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Zeynep  0.338387  0.453825      -0.489662
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [97]:
booleanFrame = yeniDataFrame < 0

In [98]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil    False  False          False
Zeynep  False  False           True
Atlas   False   True          False
Mehmet   True  False          False

In [99]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Zeynep  0.338387  0.453825      -0.489662
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [100]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN            NaN
Zeynep       NaN       NaN      -0.489662
Atlas        NaN -0.408636            NaN
Mehmet -0.334563       NaN            NaN

In [101]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN            NaN
Zeynep       NaN       NaN      -0.489662
Atlas        NaN -0.408636            NaN
Mehmet -0.334563       NaN            NaN

In [102]:
yeniDataFrame[yeniDataFrame["Calisma Saati"] > 0]

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [103]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  1.112853  1.415367       1.345171
1  Zeynep  0.338387  0.453825      -0.489662
2   Atlas  0.173487 -0.408636       0.304900
3  Mehmet -0.334563  0.094900       0.076624

In [104]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.112853  1.415367       1.345171
Zeynep  0.338387  0.453825      -0.489662
Atlas   0.173487 -0.408636       0.304900
Mehmet -0.334563  0.094900       0.076624

In [105]:
yeniIndexListesi = ["Ati","Zey","Atl","Meh"]

In [106]:
yeniDataFrame["Yeni Indeks"] = yeniIndexListesi

In [107]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    1.112853  1.415367       1.345171         Ati
Zeynep  0.338387  0.453825      -0.489662         Zey
Atlas   0.173487 -0.408636       0.304900         Atl
Mehmet -0.334563  0.094900       0.076624         Meh

In [108]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          1.112853  1.415367       1.345171
Zey          0.338387  0.453825      -0.489662
Atl          0.173487 -0.408636       0.304900
Meh         -0.334563  0.094900       0.076624

In [109]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    1.112853  1.415367       1.345171         Ati
Zeynep  0.338387  0.453825      -0.489662         Zey
Atlas   0.173487 -0.408636       0.304900         Atl
Mehmet -0.334563  0.094900       0.076624         Meh

In [110]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [111]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          1.112853  1.415367       1.345171
Zey          0.338387  0.453825      -0.489662
Atl          0.173487 -0.408636       0.304900
Meh         -0.334563  0.094900       0.076624

In [112]:
yeniDataFrame.loc["Ati"]

Maas             1.112853
Yas              1.415367
Calisma Saati    1.345171
Name: Ati, dtype: float64

In [113]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [132]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [133]:
BirlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [134]:
BirlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [135]:
BirlesmisIndeks = pd.MultiIndex.from_tuples(BirlesmisIndeks)

In [136]:
BirlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [137]:
benimizgiFilmlistem = [[40,"A"],[10,"B"],[30,"C"],[9, "D"],[10, "E"],[11,"F"]]

In [138]:
cizgiFilmNumpyDizisi = np.array(benimizgiFilmlistem)

In [139]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=BirlesmisIndeks,columns=["Yas","Meslek"])

In [140]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [141]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [142]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [145]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [146]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [147]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F